<a href="https://colab.research.google.com/github/Sedinei/DSWP/blob/master/NB_trabalhado/Titanic_NB10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# carregar a library Pandas
import pandas as pd

In [2]:
# Ajusta as configurações do Pandas
d_configuracao = {
    'display.max_columns': 1000,
    'display.expand_frame_repr': True,
    'display.max_rows': 10,
    'display.precision': 2,
    'display.show_dimensions': True
                  }

for op, value in d_configuracao.items():
    pd.set_option(op, value)
    print(op, value)

display.max_columns 1000
display.expand_frame_repr True
display.max_rows 10
display.precision 2
display.show_dimensions True

* Segue o dicionário de dados do dataframe df_Titanic:
    * PassengerID: ID do passageiro;
    * survived: Indicador, sendo 1= Passageiro sobreviveu e 0= Passageiro morreu;
    * Pclass: Classe;
    * Age: Idade do Passageiro;
    * SibSp: Número de parentes a bordo (esposa, irmãos, pais e etc);
    * Parch: Número de pais/crianças a bordo;
    * Fare: Valor pago pelo Passageiro;
    * Cabin: Cabine do Passageiro;
    * Embarked: A porta pelo qual o Passageiro embarcou.
    * Name: Nome do Passageiro;
    * sex: sexo do Passageiro.

A seguir, vamos:
* Ler o dataframe Titanic.csv;
* Definir 'PassengerId' como índice/chave da tabela através do comando index_col= 'PassengerId'.

In [3]:
url = 'https://raw.githubusercontent.com/Sedinei/DSWP/master/Dataframes/Titanic_With_MV.csv'
df_Titanic = pd.read_csv(url, index_col = 'PassengerId')
df_Titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.28,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.92,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.10,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

In [15]:
# Deixando os nomes das colunas em minúsculas e os dados do DataFrame
df_Titanic.columns = [col.lower() for col in df_Titanic.columns]
# Altera o nome do índice
indice = df_Titanic.index
indice.name = indice.name.lower()
df_Titanic.index = indice
df_Titanic = df_Titanic.applymap(lambda x: x.lower() if type(x) == str else x)
df_Titanic.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
passengerid,,,,,,,,,,,
1,0,3,"braund, mr. owen harris",male,22.0,1,0,a/5 21171,7.25,NaN,s
2,1,1,"cumings, mrs. john bradley (florence briggs th...",female,38.0,1,0,pc 17599,71.28,c85,c
3,1,3,"heikkinen, miss. laina",female,26.0,0,0,ston/o2. 3101282,7.92,NaN,s
4,1,1,"futrelle, mrs. jacques heath (lily may peel)",female,35.0,1,0,113803,53.10,c123,s
5,0,3,"allen, mr. william henry",male,35.0,0,0,373450,8.05,NaN,s

In [18]:
df_Titanic.loc[1:3,'name': 'ticket'].head()

,name,sex,age,sibsp,parch,ticket
passengerid,,,,,,
1,"braund, mr. owen harris",male,22.0,1,0,a/5 21171
2,"cumings, mrs. john bradley (florence briggs th...",female,38.0,1,0,pc 17599
3,"heikkinen, miss. laina",female,26.0,0,0,ston/o2. 3101282

In [27]:
df_Titanic.loc[1]

survived                          0
pclass                            3
name        braund, mr. owen harris
sex                            male
age                              22
                     ...
parch                             0
ticket                    a/5 21171
fare                            7.2
cabin                           NaN
embarked                          s
Name: 1, Length: 11, dtype: object